/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: marvin <marvin@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/08/23 23:18:33 by marvin            #+#    #+#             */
/*   Updated: 2025/08/23 23:18:33 by marvin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Zombie.hpp"

int main()
{
    Zombie* horde = zombieHorde(5, "Foo");

    // 全員が自己紹介
    for (int i = 0; i < 5; ++i) {
        horde[i].announce();
    }

    // 忘れずに配列を解放
    delete[] horde;

    return 0;
}